{
  "metadata": {
    "generated_date": "2024-11-07T14:38:57.393935",
    "number_of_recipes": 3
  },
  "recipes": [
    {
      "recipe_number": 1,
      "title": "Khao Soi-Style Stir-Fry",
      "recipe_text": "**Recipe 1: Stir-Fried Thai Egg Noodle with Chicken and Vegetables**\nOverview:\nTitle: Khao Soi-Style Stir-Fry\nDifficulty level: Medium\nTime: 20 minutes (Prep: 10 minutes, Cook: 10 minutes, Total: 20 minutes)\nServings: 4\nComprehensive allergen and dietary compliance statement: This recipe is free from nuts, shellfish, soy sauce, gluten, dairy, high-sodium ingredients, artificial preservatives, and additives. It is also designed to avoid cross-contamination with gluten and nuts.\nIngredients:\n* 1 pound boneless, skinless chicken breast, cut into bite-sized pieces\n* 2 tablespoons coconut oil\n* 1 onion, thinly sliced\n* 2 cloves garlic, minced\n* 1 cup mixed vegetables (bell peppers, carrots, snap peas)\n* 1 cup Thai egg noodles\n* 2 tablespoons fish sauce (make sure it's gluten-free)\n* 1 tablespoon lime juice\n* 1 teaspoon grated ginger\n* Salt and pepper to taste\n* Fresh cilantro leaves for garnish\nInstructions:\n1. Cook the Thai egg noodles according to package instructions. Drain and set aside.\n2. In a large skillet or wok, heat the coconut oil over medium-high heat. Add the chicken and cook until browned, about 5 minutes. Remove from the skillet and set aside.\n3. In the same skillet, add the sliced onion and cook until translucent, about 3 minutes. Add the minced garlic and cook for an additional minute.\n4. Add the mixed vegetables to the skillet and cook until they're tender-crisp, about 3-4 minutes.\n5. Add the cooked chicken back into the skillet and stir in the fish sauce, lime juice, and grated ginger. Cook for an additional minute.\n6. Add the cooked noodles to the skillet and stir-fry everything together until well combined. Season with salt and pepper to taste.\n7. Garnish with fresh cilantro leaves and serve hot.\nStorage & Serving:\nStore leftovers in an airtight container in the refrigerator for up to 3 days. Reheat in the microwave or on the stovetop. Serve hot, garnished with additional cilantro leaves if desired."
    },
    {
      "recipe_number": 2,
      "title": "Yum Woon Sen-Style Salad",
      "recipe_text": "**Recipe 2: Grilled Thai Egg Noodle Salad with Shrimp and Mango**\nOverview:\nTitle: Yum Woon Sen-Style Salad\nDifficulty level: Easy\nTime: 25 minutes (Prep: 15 minutes, Cook: 10 minutes, Total: 25 minutes)\nServings: 4\nComprehensive allergen and dietary compliance statement: This recipe is free from nuts, shellfish, soy sauce, gluten, dairy, high-sodium ingredients, artificial preservatives, and additives. It is also designed to avoid cross-contamination with gluten and nuts.\nIngredients:\n* 1 pound large shrimp, peeled and deveined\n* 2 tablespoons coconut oil\n* 1 ripe mango, diced\n* 1 cup mixed greens (such as arugula, spinach, and lettuce)\n* 1 cup Thai egg noodles\n* 2 tablespoons fish sauce (make sure it's gluten-free)\n* 1 tablespoon lime juice\n* 1 teaspoon grated ginger\n* Salt and pepper to taste\n* Fresh cilantro leaves for garnish\nInstructions:\n1. Preheat a grill or grill pan to medium-high heat. Season the shrimp with salt and pepper. Grill the shrimp for 2-3 minutes per side, or until they're pink and cooked through. Set aside.\n2. In a large bowl, combine the mixed greens, diced mango, and cooked noodles.\n3. In a small bowl, whisk together the fish sauce, lime juice, and grated ginger. Pour the dressing over the salad and toss to combine.\n4. Slice the grilled shrimp into bite-sized pieces and add them to the salad. Toss gently to combine.\n5. Season with salt and pepper to taste. Garnish with fresh cilantro leaves and serve immediately.\nStorage & Serving:\nStore leftovers in an airtight container in the refrigerator for up to 3 days. Serve chilled or at room temperature."
    },
    {
      "recipe_number": 3,
      "title": "Pad Thai-Style Casserole",
      "recipe_text": "**Recipe 3: Baked Thai Egg Noodle Casserole with Chicken and Vegetables**\nOverview:\nTitle: Pad Thai-Style Casserole\nDifficulty level: Medium\nTime: 35 minutes (Prep: 15 minutes, Cook: 20 minutes, Total: 35 minutes)\nServings: 4\nComprehensive allergen and dietary compliance statement: This recipe is free from nuts, shellfish, soy sauce, gluten, dairy, high-sodium ingredients, artificial preservatives, and additives. It is also designed to avoid cross-contamination with gluten and nuts.\nIngredients:\n* 1 pound boneless, skinless chicken breast, cut into bite-sized pieces\n* 2 tablespoons coconut oil\n* 1 onion, thinly sliced\n* 2 cloves garlic, minced\n* 1 cup mixed vegetables (carrots, bell peppers, snap peas)\n* 1 cup Thai egg noodles\n* 2 tablespoons fish sauce (make sure it's gluten-free)\n* 1 tablespoon lime juice\n* 1 teaspoon grated ginger\n* Salt and pepper to taste\n* 1 cup shredded coconut (make sure it's free from nuts)\nInstructions:\n1. Preheat the oven to 375°F (190°C).\n2. Cook the Thai egg noodles according to package instructions. Drain and set aside.\n3. In a large skillet or wok, heat the coconut oil over medium-high heat. Add the chicken and cook until browned, about 5 minutes. Remove from the skillet and set aside.\n4. In the same skillet, add the sliced onion and cook until translucent, about 3 minutes. Add the minced garlic and cook for an additional minute.\n5. Add the mixed vegetables to the skillet and cook until they're tender-crisp, about 3-4 minutes.\n6. In a large bowl, combine the cooked noodles, chicken, and vegetable mixture.\n7. In a small bowl, whisk together the fish sauce, lime juice, and grated ginger. Pour the dressing over the noodle mixture and toss to combine.\n8. Transfer the noodle mixture to a 9x13-inch baking dish. Top with shredded coconut and bake for 15-20 minutes, or until the coconut is lightly toasted.\n9. Serve hot, garnished with fresh cilantro leaves if desired.\nStorage & Serving:\nStore leftovers in an airtight container in the refrigerator for up to 3 days. Reheat in the oven or microwave. Serve hot, garnished with additional cilantro leaves if desired."
    }
  ]
}